// Q) 생존율 출력 프로그램
/*
다음 표는 심장 정지 환자에게 자동 심장 충격기를 사용했을 때 
최초로 시행한 시간에 따른 환자의 생존율을 나타냅니다.
표를 보고 장비를 사용하기까지 걸린 시간을 입력하면 
생존율이 출력되는 프로그램을 만들어봅시다.

--------------------------------------------------------------------
시간    |  60초  |  120초  |  180초  |  240초  |  300초  |  300초 초과
생존율  |   85%  |   76%   |    66%  |   57%  |    47%  |   25% 미만
--------------------------------------------------------------------
*/

var useAed = Number(prompt('AED 사용까지 걸린 시간: (단위: 초(s))'));

if (useAed <= 60) {
    alert('85%');
} else if (useAed <= 120){
    alert('76%');
} else if (useAed <= 180){
    alert('66%');
} else if (useAed <= 240){
    alert('57%');
} else if (useAed <= 300){
    alert('47%');
} else {
    alert('25% 미만');
}